In [2]:
# Load the libraries
import numpy as np 
import pandas as pd 
import seaborn as sns
import re
from matplotlib import pyplot as plt
import matplotlib.pyplot as plt
from warnings import filterwarnings
filterwarnings('ignore')

from scipy.stats.mstats import winsorize
import scipy.stats as stats
from sklearn.preprocessing import normalize
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import r2_score, mean_squared_error, mean_absolute_error,explained_variance_score
from sklearn.linear_model import LinearRegression,Ridge,Lasso
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import (GridSearchCV, cross_val_score, cross_val_predict, StratifiedKFold, learning_curve)
from sklearn.metrics import confusion_matrix, classification_report

from statsmodels.tools.eval_measures import mse, rmse
from sklearn import preprocessing
## Display all the columns of the dataframe
pd.pandas.set_option('display.max_columns', None)

In [3]:
df=pd.read_csv("PRT_Quarterly_Employment_By_Occupation.csv")
df.head(2)

,ref_area.label,indicator.label,source.label,sex.label,classif1.label,classif2.label,time,obs_value,obs_status.label,note_classif.label,note_indicator.label,note_source.label
0,Portugal,Employees by sex and economic activity (thousa...,LFS - EU Labour Force Survey,Sex: Male,Economic activity (Aggregate): Construction,NaN,2020Q4,185.8,NaN,NaN,Frequency: Quarterly,NaN
1,Portugal,Employees by sex and economic activity (thousa...,LFS - EU Labour Force Survey,Sex: Female,Economic activity (Aggregate): Construction,NaN,2020Q4,23.4,NaN,NaN,Frequency: Quarterly,NaN

In [41]:
df.tail(2)

,ref_area.label,indicator.label,source.label,sex.label,classif1.label,classif2.label,time,obs_value,obs_status.label,note_classif.label,note_indicator.label,note_source.label
486,Portugal,Employees by sex and occupation (thousands),LFS - EU Labour Force Survey,Sex: Male,Occupation (ISCO-08): 4. Clerical support workers,NaN,2011Q1,145.3,Break in series,NaN,Frequency: Quarterly | Break in series: Method...,NaN
487,Portugal,Employees by sex and occupation (thousands),LFS - EU Labour Force Survey,Sex: Female,Occupation (ISCO-08): 4. Clerical support workers,NaN,2011Q1,259.9,Break in series,NaN,Frequency: Quarterly | Break in series: Method...,NaN

In [42]:
df.shape

(488, 12)

In [43]:
df.isnull().sum()

ref_area.label            0
indicator.label           0
source.label              0
sex.label                 0
classif1.label            0
classif2.label          488
time                      0
obs_value                 0
obs_status.label        474
note_classif.label      488
note_indicator.label      0
note_source.label       488
dtype: int64

In [44]:
df=df[["sex.label", "classif1.label", "time", "obs_value"]]

In [45]:
df.head()

     sex.label                               classif1.label    time  obs_value
0    Sex: Male  Economic activity (Aggregate): Construction  2020Q4      185.8
1  Sex: Female  Economic activity (Aggregate): Construction  2020Q4       23.4
2    Sex: Male  Economic activity (Aggregate): Construction  2020Q3      203.3
3  Sex: Female  Economic activity (Aggregate): Construction  2020Q3       23.1
4    Sex: Male  Economic activity (Aggregate): Construction  2020Q2      206.0

In [46]:
df["sex.label"].unique()

array(['Sex: Male', 'Sex: Female'], dtype=object)

In [47]:
df["classif1.label"].unique()

array(['Economic activity (Aggregate): Construction',
       'Occupation (Skill level): Skill levels 3 and 4 ~ high',
       'Occupation (Skill level): Skill level 2 ~ medium',
       'Occupation (Skill level): Skill level 1 ~ low',
       'Occupation (ISCO-08): 4. Clerical support workers'], dtype=object)

In [48]:
df.tail()

,sex.label,classif1.label,time,obs_value
483,Sex: Female,Occupation (Skill level): Skill levels 3 and 4...,2011Q1,545.1
484,Sex: Female,Occupation (Skill level): Skill level 2 ~ medium,2011Q1,918.8
485,Sex: Female,Occupation (Skill level): Skill level 1 ~ low,2011Q1,395.0
486,Sex: Male,Occupation (ISCO-08): 4. Clerical support workers,2011Q1,145.3
487,Sex: Female,Occupation (ISCO-08): 4. Clerical support workers,2011Q1,259.9

In [49]:
df['gender'] = df['sex.label'].str.extract('(Male|Female)')

In [50]:
df['male'] = df['gender'].apply(lambda x: 1 if x == 'Male' else 0)
df['female'] = df['gender'].apply(lambda x: 1 if x == 'Female' else 0)

In [51]:
df.drop(columns=['sex.label'], inplace=True)

In [52]:
df.head()

,classif1.label,time,obs_value,gender,male,female
0,Economic activity (Aggregate): Construction,2020Q4,185.8,Male,1,0
1,Economic activity (Aggregate): Construction,2020Q4,23.4,Female,0,1
2,Economic activity (Aggregate): Construction,2020Q3,203.3,Male,1,0
3,Economic activity (Aggregate): Construction,2020Q3,23.1,Female,0,1
4,Economic activity (Aggregate): Construction,2020Q2,206.0,Male,1,0

In [53]:
df["classif1.label"].unique()

array(['Economic activity (Aggregate): Construction',
       'Occupation (Skill level): Skill levels 3 and 4 ~ high',
       'Occupation (Skill level): Skill level 2 ~ medium',
       'Occupation (Skill level): Skill level 1 ~ low',
       'Occupation (ISCO-08): 4. Clerical support workers'], dtype=object)

In [54]:
new_df = pd.DataFrame()

# create a column for each label, filled with zeros
new_df['Construction'] = 0
new_df['Clerical support workers'] = 0
new_df['Skill levels 3 and 4 ~ high'] = 0
new_df['Skill level 2 ~ medium'] = 0
new_df['Skill level 1 ~ low'] = 0


# loop through each row of the original dataframe
for index, row in df.iterrows():

    # get the label from the current row
    label = row['classif1.label']

    # set the value in the appropriate new column to 1
    if label == 'Occupation (ISCO-08): 4. Clerical support workers':
        new_df.at[index, 'Clerical support workers'] = 1
    elif label == 'Economic activity (Aggregate): Construction':
        new_df.at[index, 'Construction'] = 1
    elif label == 'Occupation (Skill level): Skill levels 3 and 4 ~ high':
        new_df.at[index, 'Skill levels 3 and 4 ~ high'] = 1
    elif label == 'Occupation (Skill level): Skill level 2 ~ medium':
        new_df.at[index, 'Skill level 2 ~ medium'] = 1
    elif label == 'Occupation (Skill level): Skill level 1 ~ low':
        new_df.at[index, 'Skill level 1 ~ low'] = 1

# concatenate the original dataframe and the new dataframe
result_df = pd.concat([df, new_df], axis=1)

# print the resulting dataframe
result_df.head()

,classif1.label,time,obs_value,gender,male,female,Construction,Clerical support workers,Skill levels 3 and 4 ~ high,Skill level 2 ~ medium,Skill level 1 ~ low
0,Economic activity (Aggregate): Construction,2020Q4,185.8,Male,1,0,1.0,NaN,NaN,NaN,NaN
1,Economic activity (Aggregate): Construction,2020Q4,23.4,Female,0,1,1.0,NaN,NaN,NaN,NaN
2,Economic activity (Aggregate): Construction,2020Q3,203.3,Male,1,0,1.0,NaN,NaN,NaN,NaN
3,Economic activity (Aggregate): Construction,2020Q3,23.1,Female,0,1,1.0,NaN,NaN,NaN,NaN
4,Economic activity (Aggregate): Construction,2020Q2,206.0,Male,1,0,1.0,NaN,NaN,NaN,NaN

In [55]:
# drop the original 'classif1.label' column
result_df = result_df.drop(['classif1.label'], axis=1)

In [56]:
result_df.isnull().sum()

time                             0
obs_value                        0
gender                           0
male                             0
female                           0
Construction                   320
Clerical support workers       408
Skill levels 3 and 4 ~ high    408
Skill level 2 ~ medium         408
Skill level 1 ~ low            408
dtype: int64

In [58]:
result_df.shape

(488, 10)

In [61]:
result_df.fillna(0, inplace=True)

In [59]:
result_df=result_df.drop(["Construction","gender"],axis=1)

In [62]:
result_df.tail()

,time,obs_value,male,female,Clerical support workers,Skill levels 3 and 4 ~ high,Skill level 2 ~ medium,Skill level 1 ~ low
483,2011Q1,545.1,0,1,0.0,1.0,0.0,0.0
484,2011Q1,918.8,0,1,0.0,0.0,1.0,0.0
485,2011Q1,395.0,0,1,0.0,0.0,0.0,1.0
486,2011Q1,145.3,1,0,1.0,0.0,0.0,0.0
487,2011Q1,259.9,0,1,1.0,0.0,0.0,0.0

In [63]:
result_df.head()

,time,obs_value,male,female,Clerical support workers,Skill levels 3 and 4 ~ high,Skill level 2 ~ medium,Skill level 1 ~ low
0,2020Q4,185.8,1,0,0.0,0.0,0.0,0.0
1,2020Q4,23.4,0,1,0.0,0.0,0.0,0.0
2,2020Q3,203.3,1,0,0.0,0.0,0.0,0.0
3,2020Q3,23.1,0,1,0.0,0.0,0.0,0.0
4,2020Q2,206.0,1,0,0.0,0.0,0.0,0.0

In [64]:
df=result_df.rename(columns={'time':'Year_Quarter', 'obs_value':'Number_of_employees', 'Clerical support workers':'Clerical_support_workers',
                      'Skill levels 3 and 4 ~ high':'Skill_levels_high', 'Skill level 2 ~ medium':'Skill_level_medium',
                      'Skill level 1 ~ low':'Skill_level_low'})

In [65]:
df.tail()

,Year_Quarter,Number_of_employees,male,female,Clerical_support_workers,Skill_levels_high,Skill_level_medium,Skill_level_low
483,2011Q1,545.1,0,1,0.0,1.0,0.0,0.0
484,2011Q1,918.8,0,1,0.0,0.0,1.0,0.0
485,2011Q1,395.0,0,1,0.0,0.0,0.0,1.0
486,2011Q1,145.3,1,0,1.0,0.0,0.0,0.0
487,2011Q1,259.9,0,1,1.0,0.0,0.0,0.0

In [130]:
portugal_ml = df.to_csv('portugal_ml.csv', index=False)
#df.to_csv("Portugal_ml", index=False)

## Statistics for Data Analytics Tasks

## 1. T-Test One Population - Number_of_employees in Construction industry in Portugal.

In [66]:
df["Number_of_employees"].mean()

395.2528688524591

In [67]:
X= df["Number_of_employees"];X

0      185.8
1       23.4
2      203.3
3       23.1
4      206.0
       ...
483    545.1
484    918.8
485    395.0
486    145.3
487    259.9
Name: Number_of_employees, Length: 488, dtype: float64

In [68]:
#H0 : u = 395
#H1 : u =! 395
stats.ttest_1samp(X,395)

Ttest_1sampResult(statistic=0.016522005465077535, pvalue=0.9868247131179824)

In [69]:
##  statistic=0.016522005465077535 is the t value = 0.01

In [70]:
##  if p-value < 0.05  we reject Ho
## if p-value > 0.05 we accept tht Ho 
## the p- vlaue is 0.986 is greater than 0.05 so we accept Ho

In [71]:
## We accept H0 ---> so there is enough evidence to say that the average Number_of_employees 395,Quarterly.

## 2. T-Test - two populations Qarterly Number of employees in Q1 and Q4

In [73]:
df1=df[['Year_Quarter','Number_of_employees']]

In [88]:
df1.tail()

    Year_Quarter  Number_of_employees
483       2011Q1                545.1
484       2011Q1                918.8
485       2011Q1                395.0
486       2011Q1                145.3
487       2011Q1                259.9

In [83]:
#We group the data according to the categories requested.
Q1 = df1.query('Year_Quarter == "2020Q1"')['Number_of_employees']
Q4 = df1.query('Year_Quarter == "2020Q4"')['Number_of_employees']

In [84]:
#We perform the test assuming as H0 that mu1 = mu2 (Q1 Number_of_employees = Q4 Number_of_employees)
test = stats.ttest_ind(Q1, Q4, equal_var=True)
display(test)

Ttest_indResult(statistic=0.01570785286377611, pvalue=0.9876402621777799)

In [ ]:
## pvalue=0.98 >alpha(0.05) means we accept the H0, there is no significant difference in Q1 Number_of_employees and Q4 Number_of_employees.

In [81]:
#We group the data according to the categories requested.
Q1 = df1.query('Year_Quarter == "2011Q1"')['Number_of_employees']
Q4 = df1.query('Year_Quarter == "2011Q4"')['Number_of_employees']

In [82]:
test = stats.ttest_ind(Q1, Q4, equal_var=True)
display(test)

Ttest_indResult(statistic=0.0937639269259749, pvalue=0.9263325103994613)

In [66]:
 ## p-value 0.92 is > alpha 0.05 so we accept the H0,

## 3. Confidence Intervel

In [89]:
import scipy.stats as st

In [90]:
df.head()

,Year_Quarter,Number_of_employees,male,female,Clerical_support_workers,Skill_levels_high,Skill_level_medium,Skill_level_low
0,2020Q4,185.8,1,0,0.0,0.0,0.0,0.0
1,2020Q4,23.4,0,1,0.0,0.0,0.0,0.0
2,2020Q3,203.3,1,0,0.0,0.0,0.0,0.0
3,2020Q3,23.1,0,1,0.0,0.0,0.0,0.0
4,2020Q2,206.0,1,0,0.0,0.0,0.0,0.0

In [91]:
df["Number_of_employees"].describe()

count     488.000000
mean      395.252869
std       338.097911
min        12.700000
25%       131.675000
50%       284.800000
75%       649.900000
max      1199.500000
Name: Number_of_employees, dtype: float64

In [99]:
#DEFINE THE VARIABLE WE FIND THE CONFIDENCE INTERVEL OF Number_of_employees.
X = df.iloc[:, 1:2].values
X

array([[ 185.8],
       [  23.4],
       [ 203.3],
       [  23.1],
       [ 206. ],
       [  14.1],
       [ 220.6],
       [  12.7],
       [ 208.8],
       [  15.3],
       [ 214.2],
       [  16.8],
       [ 213.2],
       [  18. ],
       [ 208.8],
       [  19. ],
       [ 207.9],
       [  19.3],
       [ 219.1],
       [  17.5],
       [ 223.9],
       [  19.4],
       [ 211.8],
       [  19.4],
       [ 215.9],
       [  19.4],
       [ 205.1],
       [  14.3],
       [ 211.1],
       [  17.8],
       [ 208.2],
       [  20.6],
       [ 209.8],
       [  18.9],
       [ 196.5],
       [  16. ],
       [ 199.2],
       [  17.3],
       [ 201.8],
       [  15.8],
       [ 200.4],
       [  17. ],
       [ 193.3],
       [  18. ],
       [ 196.2],
       [  12.8],
       [ 191.7],
       [  14.9],
       [ 195.6],
       [  15.3],
       [ 207.8],
       [  13.4],
       [ 192.2],
       [  13. ],
       [ 200.8],
       [  14.9],
       [ 206.9],
       [  15.1],
       [ 195.6],
       [  15. ],
       [ 207.1],
       [  14.8],
       [ 219.8],
       [  15.7],
       [ 216.5],
       [  15.9],
       [ 252.7],
       [  16.4],
       [ 261.5],
       [  19.1],
       [ 264.8],
       [  14.1],
       [ 289.7],
       [  21.2],
       [ 311.4],
       [  19.3],
       [ 317.2],
       [  27.8],
       [ 311.5],
       [  22.9],
       [ 346.5],
       [  24.5],
       [ 349.1],
       [  27.5],
       [ 340.4],
       [  26.4],
       [ 334. ],
       [  25.1],
       [ 346.1],
       [  22.1],
       [ 351.3],
       [  22.3],
       [ 355.3],
       [  20.8],
       [ 356.6],
       [  18.6],
       [ 375.5],
       [  19.9],
       [ 401.4],
       [  16.5],
       [ 398.6],
       [  15.9],
       [ 405.4],
       [  17.3],
       [ 422.8],
       [  17.5],
       [ 413.1],
       [  18.4],
       [ 395.6],
       [  23.1],
       [ 396.4],
       [  20.9],
       [ 402.8],
       [  19. ],
       [ 398.7],
       [  19.1],
       [ 392.9],
       [  19.3],
       [ 390.6],
       [  20. ],
       [ 395. ],
       [  20.5],
       [ 401.2],
       [  20.6],
       [ 382.8],
       [  19.2],
       [ 368.8],
       [  19. ],
       [ 364.2],
       [  19. ],
       [ 371.4],
       [  19.3],
       [ 383.8],
       [  19.9],
       [ 383. ],
       [  20.5],
       [ 394.8],
       [  21.1],
       [ 413.9],
       [  19.4],
       [ 427.6],
       [  18.8],
       [ 411.9],
       [  19.8],
       [ 442.5],
       [  21.9],
       [ 455.6],
       [  19.7],
       [ 431.9],
       [  20.9],
       [ 432.2],
       [  19.2],
       [ 416.3],
       [  19.9],
       [ 406. ],
       [  19.9],
       [ 403.9],
       [  16.9],
       [ 417.8],
       [  21.5],
       [ 430.3],
       [  20.4],
       [ 434.3],
       [  20.6],
       [ 422.8],
       [  21.4],
       [ 417.8],
       [  18.9],
       [ 776.4],
       [1063.7],
       [  89.4],
       [ 885.4],
       [ 945.9],
       [ 263.4],
       [ 156.1],
       [ 246.4],
       [ 732.7],
       [1085.7],
       [  90.4],
       [ 842. ],
       [ 968.4],
       [ 267.2],
       [ 157.5],
       [ 248. ],
       [ 701.6],
       [1081.3],
       [ 108. ],
       [ 808.3],
       [ 959.5],
       [ 258.4],
       [ 152.1],
       [ 258.7],
       [ 690.6],
       [1134.1],
       [ 124.5],
       [ 796.4],
       [1003.7],
       [ 279.9],
       [ 140. ],
       [ 261.7],
       [ 689.3],
       [1150.5],
       [ 123.5],
       [ 775.1],
       [1027.3],
       [ 294.5],
       [ 160.2],
       [ 268.5],
       [ 698.3],
       [1166.1],
       [ 134.6],
       [ 761.1],
       [1039.2],
       [ 304.7],
       [ 155.5],
       [ 270.1],
       [ 695.7],
       [1140.6],
       [ 118.9],
       [ 790.7],
       [1016.9],
       [ 300.5],
       [ 138.8],
       [ 261.3],
       [ 684.7],
       [1135.4],
       [ 122.8],
       [ 791.7],
       [ 993.6],
       [ 290. ],
       [ 129.4],
       [ 250. ],
       [ 666.7],
       [1147.3],
       [ 135.3],
       [ 809.4],
       [ 959.1],
       [ 311. ],
       [ 134.7],
       [ 228.2],
       [ 654.6],
       [1159.1],
       [ 140.8],
       [ 781.7],
       [1006.2],
       [ 321.8],
       [ 138. ],
       [ 255.5],
       [ 669.4],
       [1151. ],
       [ 143.7],
       [ 806.6],
       [ 949.4],
       [ 324.4],
       [ 125.8],
       [ 233.1],
       [ 660.6],
       [1131.8],
       [ 143.2],
       [ 807.5],
       [ 921.5],
       [ 327.2],
       [ 123.9],
       [ 213.7],
       [ 655.9],
       [1133.7],
       [ 145.7],
       [ 792.8],
       [ 912.3],
       [ 349.1],
       [ 125.1],
       [ 219.6],
       [ 662. ],
       [1125.8],
       [ 149.9],
       [ 751.3],
       [ 943.3],
       [ 345.9],
       [ 130.5],
       [ 244.8],
       [ 640.8],
       [1117.5],
       [ 144.4],
       [ 755.1],
       [ 910. ],
       [ 343.3],
       [ 140.7],
       [ 230.6],
       [ 646.3],
       [1068.9],
       [ 151.4],
       [ 756.2],
       [ 879.9],
       [ 333.5],
       [ 131.8],
       [ 223.5],
       [ 652.8],
       [1060.1],
       [ 136.1],
       [ 748.2],
       [ 888.1],
       [ 331. ],
       [ 122.3],
       [ 227.9],
       [ 644.5],
       [1062.5],
       [ 141.7],
       [ 725.5],
       [ 896.7],
       [ 332.6],
       [ 118. ],
       [ 230.8],
       [ 631.2],
       [1048.1],
       [ 143.2],
       [ 719.8],
       [ 879.6],
       [ 332.2],
       [ 118. ],
       [ 222.8],
       [ 635.8],
       [1011.1],
       [ 134.3],
       [ 728. ],
       [ 859.3],
       [ 323.4],
       [ 111. ],
       [ 213.2],
       [ 628.3],
       [1032.9],
       [ 140.3],
       [ 716.4],
       [ 852.4],
       [ 337.6],
       [ 123.1],
       [ 218.4],
       [ 615.1],
       [1048.7],
       [ 138.4],
       [ 706.8],
       [ 868.7],
       [ 337.9],
       [ 116.1],
       [ 215.2],
       [ 606.7],
       [1030.5],
       [ 136.7],
       [ 709.2],
       [ 860.3],
       [ 351.4],
       [ 119.9],
       [ 215.1],
       [ 611.5],
       [ 987.2],
       [ 137.6],
       [ 701.7],
       [ 843.5],
       [ 329.3],
       [ 115.7],
       [ 216.2],
       [ 616.8],
       [ 999.2],
       [ 130.6],
       [ 713.2],
       [ 826. ],
       [ 345.1],
       [ 119.4],
       [ 209.2],
       [ 590.6],
       [1038.1],
       [ 147.2],
       [ 649. ],
       [ 870.8],
       [ 354.4],
       [ 116. ],
       [ 237.8],
       [ 569.9],
       [1030.1],
       [ 134.3],
       [ 652.6],
       [ 845.1],
       [ 342.9],
       [ 121. ],
       [ 230.5],
       [ 545.9],
       [ 993.6],
       [ 134.6],
       [ 659.7],
       [ 803.5],
       [ 353.7],
       [ 118.1],
       [ 207.6],
       [ 540.1],
       [1015.8],
       [ 136. ],
       [ 638.1],
       [ 804.8],
       [ 354.5],
       [ 118.6],
       [ 209.5],
       [ 533.4],
       [1005.9],
       [ 137.5],
       [ 591.7],
       [ 811.3],
       [ 363. ],
       [ 123.1],
       [ 203.8],
       [ 509. ],
       [1017.3],
       [ 135.7],
       [ 591.9],
       [ 792.7],
       [ 372.1],
       [ 117.3],
       [ 192.1],
       [ 508.6],
       [ 991.5],
       [ 134.8],
       [ 581.1],
       [ 779.8],
       [ 380. ],
       [ 111.2],
       [ 190.6],
       [ 510.9],
       [1017.8],
       [ 134.7],
       [ 599.4],
       [ 786.6],
       [ 370. ],
       [ 118.9],
       [ 201.3],
       [ 500. ],
       [1084.4],
       [ 140.3],
       [ 590.4],
       [ 823.4],
       [ 386. ],
       [ 126.8],
       [ 208. ],
       [ 520.1],
       [1084.6],
       [ 129.5],
       [ 584.5],
       [ 859.4],
       [ 375.6],
       [ 124.7],
       [ 228.5],
       [ 507.1],
       [1093. ],
       [ 126.5],
       [ 570.3],
       [ 864.7],
       [ 389.4],
       [ 130.7],
       [ 239.4],
       [ 501.1],
       [1132.4],
       [ 134.8],
       [ 557. ],
       [ 874.3],
       [ 407.1],
       [ 132.6],
       [ 239.3],
       [ 521.3],
       [1199.5],
       [ 131.2],
       [ 555.5],
       [ 900.4],
       [ 398.2],
       [ 124.1],
       [ 245. ],
       [ 513.8],
       [1193.3],
       [ 137.7],
       [ 574.3],
       [ 917.8],
       [ 401.3],
       [ 131.3],
       [ 255.5],
       [ 522.6],
       [1180.5],
       [ 138.1],
       [ 545.1],
       [ 918.8],
       [ 395. ],
       [ 145.3],
       [ 259.9]])

In [100]:
#CENTRAL TENDENCY FOR THE Number_of_employees
mean = X.mean()
print("The mean is ", mean)

The mean is  395.2528688524591

In [101]:
#create 90% confidence interval for population mean of Number_of_employees per Quater
st.t.interval(alpha=0.95, df=len(X)-1, loc=np.mean(X), scale=st.sem(X))

(array([365.18093644]), array([425.32480127]))

In [73]:
## The population average Number_of_employees is between 365 and 425.

## Non-Parametric Tests ## Need to split the notebook from here.

## 1. Sign Test

In [ ]:
## Apply the sign test to compare the median Number_of_employees per Year_Quarter between the years 2011Q1 and 2020Q4.

In [ ]:
## H0 : The median Number_of_employees per Year_Quarter in construction industry are the same for the years between 2011Q1 and 2020Q4.
## H1 : The median Number_of_employees per Year_Quarter in construction industry different for the years between 2011Q1 and 2020Q4.

In [102]:
df.head()

,Year_Quarter,Number_of_employees,male,female,Clerical_support_workers,Skill_levels_high,Skill_level_medium,Skill_level_low
0,2020Q4,185.8,1,0,0.0,0.0,0.0,0.0
1,2020Q4,23.4,0,1,0.0,0.0,0.0,0.0
2,2020Q3,203.3,1,0,0.0,0.0,0.0,0.0
3,2020Q3,23.1,0,1,0.0,0.0,0.0,0.0
4,2020Q2,206.0,1,0,0.0,0.0,0.0,0.0

In [104]:
# subset the data for years 2011Q1 and 2020Q4
df_subset = df[df["Year_Quarter"].isin(["2011Q1", "2020Q4"])]
df_subset

,Year_Quarter,Number_of_employees,male,female,Clerical_support_workers,Skill_levels_high,Skill_level_medium,Skill_level_low
0,2020Q4,185.8,1,0,0.0,0.0,0.0,0.0
1,2020Q4,23.4,0,1,0.0,0.0,0.0,0.0
78,2011Q1,311.5,1,0,0.0,0.0,0.0,0.0
79,2011Q1,22.9,0,1,0.0,0.0,0.0,0.0
168,2020Q4,776.4,1,0,0.0,1.0,0.0,0.0
169,2020Q4,1063.7,1,0,0.0,0.0,1.0,0.0
170,2020Q4,89.4,1,0,0.0,0.0,0.0,1.0
171,2020Q4,885.4,0,1,0.0,1.0,0.0,0.0
172,2020Q4,945.9,0,1,0.0,0.0,1.0,0.0
173,2020Q4,263.4,0,1,0.0,0.0,0.0,1.0
174,2020Q4,156.1,1,0,1.0,0.0,0.0,0.0
175,2020Q4,246.4,0,1,1.0,0.0,0.0,0.0
480,2011Q1,522.6,1,0,0.0,1.0,0.0,0.0
481,2011Q1,1180.5,1,0,0.0,0.0,1.0,0.0
482,2011Q1,138.1,1,0,0.0,0.0,0.0,1.0
483,2011Q1,545.1,0,1,0.0,1.0,0.0,0.0
484,2011Q1,918.8,0,1,0.0,0.0,1.0,0.0
485,2011Q1,395.0,0,1,0.0,0.0,0.0,1.0
486,2011Q1,145.3,1,0,1.0,0.0,0.0,0.0
487,2011Q1,259.9,0,1,1.0,0.0,0.0,0.0

In [105]:
# calculate the difference in Number_of_employees between the years 2011Q1 and 2020Q4
diff = df_subset.loc[df_subset["Year_Quarter"] == "2011Q1","Number_of_employees"].iloc[0] - \
       df_subset.loc[df_subset["Year_Quarter"] == "2020Q4","Number_of_employees"].iloc[0]
diff

125.69999999999999

In [106]:
# create a new column to indicate whether the difference is positive, negative, or zero
df_subset["diff_sign"] = df_subset["Number_of_employees"].apply(lambda x: "+" if x > diff else "-" if x < diff else "0")

In [107]:
df_subset["diff_sign"]

0      +
1      -
78     +
79     -
168    +
169    +
170    -
171    +
172    +
173    +
174    +
175    +
480    +
481    +
482    +
483    +
484    +
485    +
486    +
487    +
Name: diff_sign, dtype: object

In [108]:
# count the number of positive and negative differences
counts = df_subset["diff_sign"].value_counts()
counts

diff_sign
+    17
-     3
Name: count, dtype: int64

In [110]:
from scipy import stats

In [112]:
# calculate the p-value
p_value = stats.binom_test(counts, n=counts.sum(), p=0.5)

In [113]:
print(f"Test statistic: {counts}")
print(f"P-value: {p_value}")

Test statistic: diff_sign
+    17
-     3
Name: count, dtype: int64
P-value: 0.0025768280029296875

In [ ]:
## Accroding to the pvalue 0.0025 < alpha(0.05) we reject the H0, 
## means there is no evidence to say that The median Number_of_employees per Year_Quarter in construction industry are the same for the years between 2011Q1 and 2020Q4.

## 2. Kruskal-Wallis H test

In [114]:
from scipy.stats import kruskal

In [115]:
## H0: there is no difference in weekly earnings in Quater1 to Q4
## H1: there is at least one of the Quarterly earnings has differences

In [118]:
df.tail()

,Year_Quarter,Number_of_employees,male,female,Clerical_support_workers,Skill_levels_high,Skill_level_medium,Skill_level_low
483,2011Q1,545.1,0,1,0.0,1.0,0.0,0.0
484,2011Q1,918.8,0,1,0.0,0.0,1.0,0.0
485,2011Q1,395.0,0,1,0.0,0.0,0.0,1.0
486,2011Q1,145.3,1,0,1.0,0.0,0.0,0.0
487,2011Q1,259.9,0,1,1.0,0.0,0.0,0.0

In [117]:
df_subset1 = df[["Year_Quarter","Number_of_employees"]]
df_subset1.head()

  Year_Quarter  Number_of_employees
0       2020Q4                185.8
1       2020Q4                 23.4
2       2020Q3                203.3
3       2020Q3                 23.1
4       2020Q2                206.0

In [86]:
##df.to_csv("df_subset1", index=False)

In [119]:
# group the data by quarter
q1 = df.loc[df['Year_Quarter'] == '2015Q1']['Number_of_employees']
q2 = df.loc[df['Year_Quarter'] == '2015Q2']['Number_of_employees']
q3 = df.loc[df['Year_Quarter'] == '2015Q3']['Number_of_employees']
q4 = df.loc[df['Year_Quarter'] == '2015Q4']['Number_of_employees']

In [120]:
# perform the Kruskal-Wallis H test
stat, p_value = kruskal(q1, q2, q3, q4)

In [121]:
# display the results
print('Kruskal-Wallis H Test Results:')
print('Test Statistic: {:.4f}'.format(stat))
print('p-value: {:.4f}'.format(p_value))

Kruskal-Wallis H Test Results:
Test Statistic: 0.1507
p-value: 0.9851

In [122]:
if p_value < 0.05:
    print('There is a significant difference between the quarters.')
else:
    print('There is no significant difference between the quarters.')

There is no significant difference between the quarters.

In [91]:
## According to the results Pvalue 0.98 is > alpha(0.05) so we accept the H0,
## means There is no significant difference between the Skilled_operatives weely earnings in quarters

## 3. U-Mann Whitman test

In [123]:
df2=df[['Skill_levels_high','Skill_level_low']]

In [124]:
df2.head()

   Skill_levels_high  Skill_level_low
0                0.0              0.0
1                0.0              0.0
2                0.0              0.0
3                0.0              0.0
4                0.0              0.0

In [94]:
## H0: There is no difference Number of Skill_levels_high employees and Number of Skill_levels_low 
## H1: There is no difference Number of Skill_levels_high employees and Number of Skill_levels_low

In [125]:
from scipy.stats import mannwhitneyu

In [126]:
mannwhitneyu(df2['Skill_levels_high'], df2['Skill_level_low'])

MannwhitneyuResult(statistic=119072.0, pvalue=1.0)

In [97]:
## according to the results pvalue 1.0 is > alpha(0.05) so we accept the H0,
## means there is no evidence to say that There is no difference Number of Skill_levels_high employees and Number of Skill_levels_low

## Machine Learning Tasks